app/Controllers/Home.php

SELECT *
FROM `tbl_users`
WHERE `username` = 'staf_unit'
 LIMIT 1
---
    public function login()
    {

        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $user = $this->UsersModel->where('username', $username)->first();

SELECT COUNT(*) AS `numrows` FROM `tbl_karyawan`
SELECT COUNT(*) AS `numrows` FROM `tbl_kerangka_kerja`
---
    public function dashboard()
    {
        $data = [
            'title' => 'Dashboard',
            'user_login' => $this->session->get(),
            'total_karyawan' => $this->KaryawanModel->countAll(),
            'total_kak' => $this->KerangkaKerjaModel->countAll(),

SELECT COUNT(*) AS `numrows` FROM `tbl_kerangka_kerja`
---
    public function kinerjaUnit()
    {

        $total_kak = $this->KerangkaKerjaModel->countAll();