app/Controllers/KerangkaKerja.php

    public function tambah()
    {
        $data = [
            'title' => 'Tambah Kerangka Acuan Kerja',
            'user_login' => $this->session->get(),
            'breadcrumb' => ['Data Kerangka Acuan Kerja', 'Tambah Kerangka Acuan Kerja'],
            'proker' => $this->ProkerModel->findAll(),
---
SELECT *
FROM `tbl_proker`