app/Controllers/Lpj.php

    public function validasi()
    {
        $id_lpj = $this->request->getVar('id_lpj');
        $lpj = $this->LpjModel->find($id_lpj);

        $this->LpjModel->update($id_lpj, ['catatan' => $this->request->getVar('catatan')]);

        $this->KerangkaKerjaModel->update($lpj['id_kak'], ['status' => $this->request->getVar('status')]);
---
SELECT *
FROM `tbl_lpj`
WHERE `tbl_lpj`.`id_lpj` = '0'
UPDATE `tbl_lpj` SET `catatan` = 'Sudah aman hehehe', `updated_at` = '2024-12-25 19:12:05'
WHERE `tbl_lpj`.`id_lpj` IN ('0')
UPDATE `tbl_kerangka_kerja` SET `status` = 'Perlu Perbaikan', `updated_at` = '2024-12-25 19:12:05'
WHERE `tbl_kerangka_kerja`.`id_kak` IN ('5')