app/Controllers/PaguAnggaran.php

    public function index()
    {
        $data = [
            'title' => 'Pagu Anggaran',
            'user_login' => $this->session->get(),
            'breadcrumb' => ['Pagu Anggaran'],
            'pagu' => $this->PaguAnggaranModel->findAll(),
---
SELECT *
FROM `tbl_pagu_anggaran`