app/Controllers/Users.php

    public function cari()
    {
        $keyword = $this->request->getVar('keyword');

        $data = [
            'title' => 'User Management',
            'breadcrumb' => ['User Management'],
            'users' => $this->PenggunaModel->like('nama_pengguna', $keyword)->findAll()
---
SELECT *
FROM `tbl_pengguna`
WHERE `nama_pengguna` LIKE '%piw%' ESCAPE '!'