app/Models/KaryawanModel.php

    public function getKaryawan(){
        return $this->where('jabatan !=', 'admin')
                    ->where('jabatan !=', 'kepala puskesmas')
                    ->orderBy('jabatan', 'ASC')
                    ->findAll();
---
SELECT *
FROM `tbl_karyawan`
WHERE `jabatan` != 'admin'
AND `jabatan` != 'kepala puskesmas'
ORDER BY `jabatan` ASC