app/Models/KerangkaKerjaModel.php

    public function getKerjangkaKerjaWithUsers()
    {
        return $this->select('tbl_kerangka_kerja.*, tbl_karyawan.NIP, tbl_karyawan.nama_karyawan')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->findAll();
---
SELECT `tbl_kerangka_kerja`.*, `tbl_pengguna`.`nip`, `tbl_pengguna`.`nama_pengguna`
FROM `tbl_kerangka_kerja`
JOIN `tbl_pengguna` ON `tbl_pengguna`.`nip` = `tbl_kerangka_kerja`.`penanggung_jawab`

    public function getKerjangkaKerjaLpj()
    {
        return $this->select('tbl_kerangka_kerja.id_kak, tbl_kerangka_kerja.nama_kegiatan, tbl_kerangka_kerja.tanggal_mulai,tbl_kerangka_kerja.tanggal_selesai, tbl_karyawan.nama_karyawan, tbl_karyawan.unit_kerja, tbl_kerangka_kerja.status')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('status', "Diterima")
            ->orWhere("status", "Menunggu Persetujuan LPJ")
            ->orWhere("status", "Perlu Perbaikan")
            ->findAll();
---
SELECT `tbl_kerangka_kerja`.`id_kak`, `tbl_kerangka_kerja`.`nama_kegiatan`, `tbl_kerangka_kerja`.`tanggal_mulai`, `tbl_kerangka_kerja`.`tanggal_selesai`, `tbl_karyawan`.`nama_karyawan`, `tbl_karyawan`.`unit_kerja`, `tbl_kerangka_kerja`.`status`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `status` = 'Diterima'
OR `status` = 'Menunggu Persetujuan LPJ'
OR `status` = 'Perlu Perbaikan'