app/Models/KerangkaKerjaModel.php

SELECT `tbl_kerangka_kerja`.*, `tbl_karyawan`.`NIP`, `tbl_karyawan`.`nama_karyawan`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `status` = 'Diproses'
---
    public function getKerjangkaKerjaWithUsers()
    {
        return $this->select('tbl_kerangka_kerja.*, tbl_karyawan.NIP, tbl_karyawan.nama_karyawan')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('status', "Diproses")
            ->findAll();

SELECT COUNT(*) AS `numrows`
FROM `tbl_kerangka_kerja`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `tbl_karyawan`.`unit_kerja` = 'Esensial dan Keperawatan Kesehatan Masyarakat'
---
    public function getKerjangkaKerjaUnit($unit){
        return $this->select('tbl_karyawan.unit_kerja, COUNT(tbl_kerangka_kerja.id_kak) as jumlah_kegiatan')
                    ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
                    ->where('tbl_karyawan.unit_kerja', $unit)
                    ->countAllResults();