app/Models/KunjunganModel.php

SELECT *
FROM `tbl_kunjungan`
WHERE `id_kak` = '11'
ORDER BY `nama_desa` ASC
---
    public function getKunjunganById($id)
    {
        return $this->where('id_kak', $id)
            ->orderBy('nama_desa', 'ASC')
            ->findAll();