app/Models/LpjModel.php

SELECT `tbl_lpj`.*, `tbl_karyawan`.`nama_karyawan`, `tbl_karyawan`.`unit_kerja`, `tbl_kerangka_kerja`.`nama_kegiatan`, `tbl_kerangka_kerja`.`tanggal_mulai`, `tbl_kerangka_kerja`.`tanggal_selesai`, `tbl_kerangka_kerja`.`anggaran_disetujui`, `tbl_kerangka_kerja`.`sasaran`, `tbl_kerangka_kerja`.`target`, `tbl_kerangka_kerja`.`status`, `tbl_kerangka_kerja`.`tanggal_diterima`, `tbl_kerangka_kerja`.`created_at`
FROM `tbl_lpj`
JOIN `tbl_kerangka_kerja` ON `tbl_lpj`.`id_kak` = `tbl_kerangka_kerja`.`id_kak`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_kerangka_kerja`.`penanggung_jawab`
WHERE `tbl_lpj`.`id_kak` = '11'
 LIMIT 1
---
    public function getLpjById($id)
    {
        return $this->select('tbl_lpj.*, tbl_karyawan.nama_karyawan, tbl_karyawan.unit_kerja, tbl_kerangka_kerja.nama_kegiatan, tbl_kerangka_kerja.tanggal_mulai, tbl_kerangka_kerja.tanggal_selesai, tbl_kerangka_kerja.anggaran_disetujui, tbl_kerangka_kerja.sasaran, tbl_kerangka_kerja.target, tbl_kerangka_kerja.status, tbl_kerangka_kerja.tanggal_diterima, tbl_kerangka_kerja.created_at', )
            ->join('tbl_kerangka_kerja', 'tbl_lpj.id_kak = tbl_kerangka_kerja.id_kak')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_kerangka_kerja.penanggung_jawab')
            ->where('tbl_lpj.id_kak', $id)
            ->first();

SELECT SUM(`anggaran_digunakan`) AS `anggaran_digunakan`
FROM `tbl_lpj`
 LIMIT 1
---
    public function jumlahAnggaranDigunakan(){
        return $this->selectSum('anggaran_digunakan')
                    ->first();