app/Models/PaguAnggaranModel.php

    public function getPaguAnggaran($tahun){
        return $this->where('tahun_anggaran', $tahun)
                    ->first();
---
SELECT *
FROM `tbl_pagu_anggaran`
WHERE `tahun_anggaran` = '2025'
 LIMIT 1