app/Models/UsersModel.php

SELECT `tbl_users`.`username`, `tbl_users`.`role`, `tbl_karyawan`.`nama_karyawan`
FROM `tbl_users`
JOIN `tbl_karyawan` ON `tbl_karyawan`.`NIP` = `tbl_users`.`NIP`
WHERE `tbl_users`.`NIP` = '196912312000023456'
---
    public function getUserKaryawan($nik)
    {
        return $this->db->table($this->table)
            ->select('tbl_users.username, tbl_users.role, tbl_karyawan.nama_karyawan')
            ->join('tbl_karyawan', 'tbl_karyawan.NIP = tbl_users.NIP')
            ->where('tbl_users.NIP', $nik)
            ->get()
            ->getRowArray();